app/views/books/_form.html.erb

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
    <%= form.label :category_id, "Category" %>
    <%= form.collection_select :category_id, Category.all, :id, :name, prompt: "Select a Category" %>