app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "price", "published_on", "created_at", "updated_at", "category_id") VALUES ('Clean Code', 'Robert C. Martin', 150.0, '2026-04-09', '2026-04-22 12:32:57.109124', '2026-04-22 12:32:57.109124', 9) RETURNING "id"
---
  def create
    @book = Book.new(book_params)
    if @book.save

SELECT "categories".* FROM "categories" ORDER BY "categories"."name" ASC
---
  def set_categories
    @categories = Category.order(:name)