app/controllers/home_controller.rb

  def dashboard
    @book_count = Book.count
    @latest_books = Book.order(created_at: :desc).limit(5)
---
SELECT COUNT(*) FROM "books"
SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC LIMIT 5