app/jobs/welcome_email_job.rb

  def perform(user_id)
    user = User.find(user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 7 LIMIT 1

  def create_job_log(status:, message:)
    JobLog.create!(
      job_name: self.class.name,
      status: status,
      executed_at: Time.current,
      message: message
    )
---
INSERT INTO "job_logs" ("job_name", "status", "executed_at", "message", "created_at", "updated_at") VALUES ('WelcomeEmailJob', 'failed', '2026-04-22 12:28:55.643322', 'undefined method `name'' for #<User id: 5, email: [FILTERED], created_at: "2026-04-22 12:28:55.619958000 +0000", updated_at: "2026-04-22 12:28:55.619958000 +0000">', '2026-04-22 12:28:55.646796', '2026-04-22 12:28:55.646796') RETURNING "id"